[
  {
  "id": 12,
  "title": "Air India Expresses Deep Condolences Following Tragic Flight AI171 Accident",
  "category": "pr",
  "date": "June 12, 2025",
  "excerpt": "Air India confirms the tragic loss of Flight AI171 en route from Ahmedabad to London Gatwick, with 241 passengers and 29 ground fatalities. The airline has pledged full support to victims' families and transparency in the investigation.",
  "image": "images/ai787.png",
  "tags": [
    "aviation",
    "accident-report",
    "press-release",
    "flight-AI171",
    "public-safety",
    "investigation",
    "Air-India",
    "grief-support"
  ],
  "content": "<p><strong>PRESS RELEASE</strong><br><em>For Immediate Release</em></p><h4>📍 New Delhi, India – June 12, 2025</h4><p>Air India is deeply saddened to confirm the tragic accident involving Flight AI171, a scheduled service operating from Ahmedabad to London Gatwick, which occurred shortly after takeoff on the morning of June 12, 2025.</p><p>The aircraft, a <strong>Boeing 787-8 Dreamliner</strong>, was carrying <strong>242 individuals</strong>, including crew members. We are heartbroken to report the loss of <strong>241 lives onboard</strong> and <strong>29 individuals on the ground</strong>. Our thoughts and prayers are with the families and loved ones of all those affected by this devastating event.</p><blockquote>“This is an unprecedented loss. We are fully committed to supporting the families of the victims and working closely with authorities to determine the cause of this tragic accident,”<br>— <strong>Vikram Mehra, CEO of Air India</strong>.</blockquote><p>Emergency response teams, in coordination with the <strong>Directorate General of Civil Aviation (DGCA)</strong>, have been deployed immediately. We have also established a dedicated helpline and family support center to provide assistance, travel, and grief counseling to the affected families.</p><p>We are cooperating with the DGCA, the <strong>Aircraft Accident Investigation Bureau (AAIB)</strong>, and international aviation safety agencies to investigate this incident. <em>Safety remains our utmost priority</em>, and we are committed to full transparency throughout the inquiry.</p><h4>Family Assistance Contact Center:</h4><ul><li>📞 <strong>1800-11-1717</strong> (Toll-Free India)</li><li>📧 <a href=\"mailto:support@airindia.in\">support@airindia.in</a></li><li>🌐 <a href=\"https://www.airindia.in/flight171-support\" target=\"_blank\">www.airindia.in/flight171-support</a></li></ul><p>Further updates will be provided as more verified information becomes available.</p><hr><h4>Media Contact:</h4><p><strong>Corporate Communications Office</strong><br>Air India Limited<br>📧 <a href=\"mailto:media@airindia.in\">media@airindia.in</a><br>☎ <strong>+91-22-2277-7111</strong></p>"
},


  {
  "id": 11,
  "title": "Coca-Cola India Announces Voluntary Recall of 500ml Bottles in Select Regions",
  "category": "pr",
  "date": "June 5, 2025",
  "excerpt": "Coca-Cola India issues a precautionary recall for a limited batch of 500ml PET bottles due to a packaging error discovered during an internal quality audit.",
  "image": "https://1000logos.net/wp-content/uploads/2021/05/Coca-Cola-logo.png",
  "content": "<p><strong>PRESS RELEASE</strong><br><em>For Immediate Release</em></p><h4>📍 New Delhi, India – June 5, 2025</h4><p>Coca-Cola India today announced a voluntary recall of its 500ml PET bottles from select markets across Delhi NCR and Uttar Pradesh, following an internal quality audit that identified a minor packaging error at its Greater Noida facility. The recall applies solely to a specific batch manufactured on May 25, 2025.</p><p>“At Coca-Cola India, consumer safety is our top priority. Although no health risks have been reported, we are taking this precautionary measure to uphold the highest standards of quality,” said Anjali Sharma, Director of Corporate Affairs, Coca-Cola India.</p><p>The company has activated its distribution and retail networks to ensure the prompt removal of affected products. Consumers who purchased the recalled batch may contact Coca-Cola India’s helpline or return the product to the nearest retail outlet for a refund or replacement.</p><p>Coca-Cola India regrets any inconvenience caused and assures that all other products remain safe and unaffected.</p><hr><p><strong>Media Contact:</strong><br>Corporate Communications Team<br>Coca-Cola India<br>📧 <a href=\"mailto:press@coca-colaindia.in\">press@coca-colaindia.in</a><br>☎️ +91-11-4567-8900</p>"
},

  {
  "id": 10,
  "title": "The Unseen Backbone",
  "category": "features",
  "date": "June 20, 2025",
  "excerpt": "Inside the quiet resilience of India’s housekeeping heroes, who remain unseen but essential in offices, hospitals, and homes.",
  "image": "images/hks.png",
  "tags": [
    "housekeeping",
    "social-justice",
    "invisible-labor",
    "workplace-diversity",
    "human-rights",
    "low-wage-workers",
    "internal-communication",
    "dignity-of-labor"
  ],
    "content": "<h1>The Unseen Backbone</h1><h3><em>Inside the quiet resilience of India’s housekeeping heroes</em></h3><p>All the employees need <strong>applause, credit, or attention</strong> whenever they show consistency in their work — except the housekeepers of that same office. <em>They remain invisible.</em> However, without them, no offices can run, no households can be spotless, and no hospitals can be safe.</p><p><strong>Every morning</strong> Ranju leaves her bed by 4 AM, fetches water from a nearby public tap, and cooks meals for her family & her lunchbox. By 8 o'clock, she reaches a steel-making industry where she works as a housekeeping staff.</p><blockquote>“Kamane to jaana hi padega,” she says softly.</blockquote><p><strong>Ranju's shift</strong> lasts for 10 hours, for which she earns <span style='color:#e74c3c'><strong>₹9,000 per month</strong></span>. She has no health insurance, no sick leave, and the workload even increases on holidays. Still, she endures — driven by a hope to educate her two children.</p><p>According to a report from <strong>NSSO</strong>, over <strong>2 million people</strong> are employed as domestic or commercial housekeeping staff. Around <strong>80% of them are women</strong>. Most work <em>without contracts, benefits, or protection.</em></p><p>Speaking to NGO <strong>Seva Nari Sangha</strong>, a spokesperson said:</p><blockquote>“The real issue is not just pay – it’s <strong>dignity</strong>. These women are not seen as professionals, even though their work is essential to public hygiene and safety.”</blockquote><p>Many corporate offices rely on vendor partners to maintain cleanliness — with no direct engagement with housekeeping staff. The result? <strong>Zero recognition. Zero communication.</strong></p><blockquote>“Ek chhota sa thank you, ya office board mein hamara naam aur ek photo bhi hame bohot khushi dega,” says Ramesh, a sweeper at a private bank.</blockquote><p><strong>Internal Communication Teams</strong> can bring change. All they need is an <span style='color:#3498db'>inclusive communication strategy</span> that gives these unsung heroes <strong>visibility, respect, and value</strong>.</p><ul><li>They clean our mess.</li><li>They battle theirs silently.</li><li><em>We owe them dignity.</em></li></ul><p><strong>Take a pledge:</strong> Next time you step into a clean room, a hygienic hospital, or a tidy office — pause for a moment. <em>Learn their names. Say thank you.</em></p><p>Because <strong>every workplace has a backbone.</strong> <br> And it’s time you saw it.</p>"
}
,
  {
    "id": 9,
    "title": "Youth and Politics: The Disconnect",
    "category": "opinion",
    "date": "May 22, 2025",
    "excerpt": "Exploring why young voters feel alienated from the political process and what can be done.",
    "image": "https://images.unsplash.com/photo-1543286386-713bdd548da4?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1740&q=80",
    "content": "<p>India has the world's largest youth population, with over 600 million people under the age of 25. Yet, political engagement among young voters remains surprisingly low. In the last general election, only 58% of eligible voters aged 18-25 cast their ballots, compared to 67% of the overall electorate.</p><p>This disconnect between youth and politics is a growing concern for the health of our democracy. As a journalism student who has interviewed dozens of young Indians across the country, I've identified several key reasons for this alienation:</p><h4>Perceived Irrelevance</h4><p>Many young people feel that mainstream politics doesn't address issues that matter to them. While politicians debate ideological positions, young voters are concerned about practical issues like employment opportunities, educational quality, mental health support, and climate change.</p>"
  },
  {
    "id": 8,
    "title": "The Rise of Campus Journalism",
    "category": "features",
    "date": "March 28, 2025",
    "excerpt": "How student publications are becoming training grounds for the next generation of journalists.",
    "image": "https://images.unsplash.com/photo-1517245386807-bb43f82c33c4?ixlib=rb-4.0.3&auto=format&fit=crop&w=1740&q=80",
    "content": "<p>Across Indian universities, a quiet revolution is taking place in campus journalism. What was once seen as a hobby for politically-minded students has transformed into a serious training ground for the next generation of journalists.</p><p>In my journey through various university campuses, I've discovered vibrant student publications tackling complex issues with professionalism and insight.</p><h4>Beyond University Walls</h4><p>The impact of campus journalism extends beyond university walls. Many student journalists are breaking stories that gain national attention.</p>"
  },
  {
    "id": 7,
    "title": "Fact-Checking in the Age of Misinformation",
    "category": "opinion",
    "date": "February 15, 2025",
    "excerpt": "The crucial role of journalists in combating fake news and misinformation.",
    "image": "https://images.unsplash.com/photo-1586339949916-3e9457bef6d3?ixlib=rb-4.0.3&auto=format&fit=crop&w=1740&q=80",
    "content": "<p>In today's digital age, misinformation spreads faster than ever before. As journalists, we find ourselves on the front lines of the battle against fake news, serving as the last line of defense for truth in an increasingly polarized world.</p><p>The proliferation of social media has created an environment where unverified claims can reach millions within minutes. During the recent state elections, I tracked how a single misleading post about polling irregularities spread to over 200,000 users in just three hours.</p>"
  },
  {
    "id": 6,
    "title": "The Ethics of AI in Journalism",
    "category": "opinion",
    "date": "December 12, 2024",
    "excerpt": "Balancing efficiency with ethical considerations in AI-assisted reporting.",
    "image": "images/teaj.png",
    "content": "<p>As artificial intelligence becomes increasingly integrated into newsrooms, journalists face new ethical dilemmas. The convenience of AI tools for tasks like data analysis, transcription, and even content generation must be balanced with concerns about accuracy, bias, and transparency.</p><p>During my internship at a major news outlet, I witnessed firsthand how AI-generated summaries of press releases were being published with minimal human oversight. While efficient, this practice raises serious questions about journalistic integrity.</p>"
  },
  {
    "id": 5,
    "title": "Reviving Regional Language Journalism",
    "category": "features",
    "date": "November 8, 2024",
    "excerpt": "The resurgence of hyperlocal news in India's regional languages.",
    "image": "https://images.unsplash.com/photo-1563986768609-322da13575f3?ixlib=rb-4.0.3&auto=format&fit=crop&w=1740&q=80",
    "content": "<p>While English-language media dominates national discourse, a quiet revolution is happening in regional language journalism. Across India, digital-native publications in languages like Tamil, Marathi, and Bengali are seeing unprecedented growth, filling gaps left by mainstream media.</p><p>In my research, I discovered that these platforms often achieve higher engagement rates than their English counterparts by focusing on hyperlocal issues that directly impact their readers' daily lives.</p>"
  },
  {
    "id": 4,
    "title": "The Future of Press Freedom",
    "category": "opinion",
    "date": "September 22, 2024",
    "excerpt": "Challenges and opportunities for independent journalism in the digital age.",
    "image": "https://images.unsplash.com/photo-1563986768494-4dee2763ff3f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1740&q=80",
    "content": "<p>Press freedom faces unprecedented challenges worldwide, with journalists increasingly targeted by both state and non-state actors. Yet, simultaneously, technology has created new opportunities for independent journalism to flourish.</p><p>Through my analysis of global press freedom indices and interviews with journalists from conflict zones, I've identified several emerging trends that will shape the future of journalism.</p>"
  },
  {
    "id": 3,
    "title": "Data Visualization in Investigative Reporting",
    "category": "features",
    "date": "August 30, 2024",
    "excerpt": "How visual storytelling is transforming complex data into compelling narratives.",
    "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?ixlib=rb-4.0.3&auto=format&fit=crop&w=1740&q=80",
    "content": "<p>The rise of data journalism has transformed how complex stories are told. By combining traditional reporting with sophisticated visualization techniques, journalists can make intricate data accessible and engaging to general audiences.</p><p>In my work on a project tracking education funding disparities, I learned how a well-designed infographic can communicate what thousands of words might struggle to convey. Visual storytelling has become an essential tool in the modern journalist's toolkit.</p>"
  },
  {
    "id": 2,
    "title": "Citizen Journalism and Professional Standards",
    "category": "opinion",
    "date": "July 17, 2024",
    "excerpt": "Navigating the relationship between professional journalism and citizen reporting.",
    "image": "https://images.unsplash.com/photo-1504711434969-e33886168f5c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1740&q=80",
    "content": "<p>The proliferation of smartphones has turned ordinary citizens into potential news gatherers, blurring the lines between professional journalism and amateur reporting. This democratization of news gathering presents both opportunities and challenges for the profession.</p><p>Through case studies of major events where citizen journalism played a crucial role, I examine how news organizations can effectively collaborate with citizen reporters while maintaining professional standards of accuracy and verification.</p>"
  },
  {
    "id": 1,
    "title": "Campus Sustainability Drive: Green Week 2025",
    "category": "pr",
    "date": "June 5, 2025",
    "excerpt": "A press release highlighting the success of Manipal University's week-long sustainability campaign.",
    "image": "https://images.unsplash.com/photo-1618220179428-22790f060632?auto=format&fit=crop&w=1740&q=80",
    "content": "<p>Manipal University Jaipur recently concluded its Green Week 2025 initiative, focused on raising awareness about sustainable practices on campus. Over 500 students participated in plantation drives, clean-up activities, and green innovation challenges.</p><img src=\"https://images.unsplash.com/photo-1564869734889-bc6d8f063e04?auto=format&fit=crop&w=1740&q=80\" alt=\"Green Week Event\"><p>“This initiative reflects our long-term commitment to environmental responsibility,” said the Dean of Student Affairs. The event received wide coverage in local media and was endorsed by environmental NGOs.</p>"
  }
]
